tomas-pankrac/stm32_imu_can/stm32_imu.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_0
ADC1.CommonPathInternal=ADC_INTERNAL_NONE
ADC1.IPParameters=Rank-1\#ChannelRegularConversion,master,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag,CommonPathInternal
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_4
ADC1.Rank-1\#ChannelRegularConversion=1
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ADC1.master=1
AppliNonSecure.IPs=CORTEX_M55_NS,GPDMA1\:I,HDP,HPDMA1\:I,LINKEDLIST,RCC,SYS\:I,GPIO\:I,NVIC2\:I,STMicroelectronics.X-CUBE-ALGOBUILD.1.4.0_AppNS\:I,MEMORYMAP
AppliSecure.IPs=CORTEX_M55_S,GPDMA1,HPDMA1,LINKEDLIST,RCC,RIF,SAU,GPIO,NVIC1\:I
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M55_FSBL.CPU_DCache=Enabled
CORTEX_M55_FSBL.CPU_ICache=Enabled
CORTEX_M55_FSBL.IPParameters=CPU_ICache,CPU_DCache
ExtMemLoader.IPs=EXTMEM_LOADER,EXTMEM_MANAGER,RCC\:I,GPIO
FDCAN1.DataSyncJumpWidth=15
FDCAN1.DataTimeSeg1=16
FDCAN1.DataTimeSeg2=15
FDCAN1.IPParameters=NominalPrescaler,TxFifoQueueElmtsNbr,RxFifo0ElmtsNbr,TxEventsNbr,TxBuffersNbr,DataTimeSeg1,DataTimeSeg2,NominalTimeSeg1,NominalTimeSeg2,NominalSyncJumpWidth,DataSyncJumpWidth,RxBuffersNbr,RxFifo1ElmtsNbr
FDCAN1.NominalPrescaler=1
FDCAN1.NominalSyncJumpWidth=5
FDCAN1.NominalTimeSeg1=26
FDCAN1.NominalTimeSeg2=5
FDCAN1.RxBuffersNbr=0
FDCAN1.RxFifo0ElmtsNbr=8
FDCAN1.RxFifo1ElmtsNbr=0
FDCAN1.TxBuffersNbr=4
FDCAN1.TxEventsNbr=0
FDCAN1.TxFifoQueueElmtsNbr=8
FDCAN2.DataSyncJumpWidth=15
FDCAN2.DataTimeSeg1=16
FDCAN2.DataTimeSeg2=15
FDCAN2.IPParameters=NominalSyncJumpWidth,DataSyncJumpWidth,DataTimeSeg1,DataTimeSeg2,RxBuffersNbr,TxBuffersNbr,NominalPrescaler,NominalTimeSeg1,NominalTimeSeg2,MessageRAMOffset,TxFifoQueueElmtsNbr,RxFifo0ElmtsNbr
FDCAN2.MessageRAMOffset=1024
FDCAN2.NominalPrescaler=1
FDCAN2.NominalSyncJumpWidth=5
FDCAN2.NominalTimeSeg1=26
FDCAN2.NominalTimeSeg2=5
FDCAN2.RxBuffersNbr=0
FDCAN2.RxFifo0ElmtsNbr=8
FDCAN2.TxBuffersNbr=4
FDCAN2.TxFifoQueueElmtsNbr=8
FDCAN3.DataSyncJumpWidth=15
FDCAN3.DataTimeSeg1=16
FDCAN3.DataTimeSeg2=15
FDCAN3.IPParameters=NominalPrescaler,NominalTimeSeg1,NominalTimeSeg2,NominalSyncJumpWidth,DataSyncJumpWidth,DataTimeSeg1,DataTimeSeg2,RxBuffersNbr,TxBuffersNbr,MessageRAMOffset,TxFifoQueueElmtsNbr,RxFifo0ElmtsNbr
FDCAN3.MessageRAMOffset=2048
FDCAN3.NominalPrescaler=1
FDCAN3.NominalSyncJumpWidth=5
FDCAN3.NominalTimeSeg1=26
FDCAN3.NominalTimeSeg2=5
FDCAN3.RxBuffersNbr=0
FDCAN3.RxFifo0ElmtsNbr=8
FDCAN3.TxBuffersNbr=4
FDCAN3.TxFifoQueueElmtsNbr=8
FSBL.IPs=CORTEX_M55_FSBL,GPDMA1,HDP,HPDMA1,LINKEDLIST,RCC,GPIO,NVIC\:I,SPI1,SPI5,DEBUG,TIM1,TIM2,FDCAN1\:I,FDCAN2,FDCAN3,XSPIM,XSPI2,ADC1,ADC2,TIM3,TIM4,TIM5,TIM9,TIM6
FSBL.Pins=PD3,PC14-OSC32_IN(OSC32_IN),PE9,PF6,PF2,PF8
File.Version=6
GPDMA1.DATAHANDLING_GPDMACH0=NONE
GPDMA1.DESTINC_GPDMACH0=DMA_DINC_INCREMENTED
GPDMA1.DESTINC_GPDMACH2=DMA_DINC_INCREMENTED
GPDMA1.DIRECTION_GPDMACH1=DMA_MEMORY_TO_PERIPH
GPDMA1.DIRECTION_GPDMACH3=DMA_MEMORY_TO_PERIPH
GPDMA1.IPHANDLE_GPDMACH0-SIMPLEREQUEST_GPDMACH0=__NULL
GPDMA1.IPHANDLE_GPDMACH1-SIMPLEREQUEST_GPDMACH1=__NULL
GPDMA1.IPHANDLE_GPDMACH2-SIMPLEREQUEST_GPDMACH2=__NULL
GPDMA1.IPHANDLE_GPDMACH3-SIMPLEREQUEST_GPDMACH3=__NULL
GPDMA1.IPParameters=IPHANDLE_GPDMACH0-SIMPLEREQUEST_GPDMACH0,REQUEST_GPDMACH0,IPHANDLE_GPDMACH1-SIMPLEREQUEST_GPDMACH1,REQUEST_GPDMACH1,DIRECTION_GPDMACH1,IPHANDLE_GPDMACH2-SIMPLEREQUEST_GPDMACH2,REQUEST_GPDMACH2,IPHANDLE_GPDMACH3-SIMPLEREQUEST_GPDMACH3,REQUEST_GPDMACH3,DIRECTION_GPDMACH3,SRCINC_GPDMACH0,SRCINC_GPDMACH1,DESTINC_GPDMACH0,DATAHANDLING_GPDMACH0,DESTINC_GPDMACH2,SRCINC_GPDMACH3
GPDMA1.REQUEST_GPDMACH0=GPDMA1_REQUEST_SPI1_RX
GPDMA1.REQUEST_GPDMACH1=GPDMA1_REQUEST_SPI1_TX
GPDMA1.REQUEST_GPDMACH2=GPDMA1_REQUEST_SPI5_RX
GPDMA1.REQUEST_GPDMACH3=GPDMA1_REQUEST_SPI5_TX
GPDMA1.SRCINC_GPDMACH0=DMA_SINC_FIXED
GPDMA1.SRCINC_GPDMACH1=DMA_SINC_INCREMENTED
GPDMA1.SRCINC_GPDMACH3=DMA_SINC_INCREMENTED
GPIO.groupedBy=Group By Peripherals
KeepUserPlacement=false
MMTAppReg1.MEMORYMAP.AppRegionName=RAM
MMTAppReg1.MEMORYMAP.ContextName=FSBL
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,Security,ContextName,Name
MMTAppReg1.MEMORYMAP.Name=RAM
MMTAppReg1.MEMORYMAP.Security=S
MMTAppReg1.MEMORYMAP.Size=262144
MMTAppReg1.MEMORYMAP.StartAddress=0x341C0000
MMTAppReg10.MEMORYMAP.AppRegionName=FLASH (NS) Reserved Alias Region
MMTAppReg10.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg10.MEMORYMAP.DefaultDataRegion=false
MMTAppReg10.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg10.MEMORYMAP.Name=FLASH (NS) Reserved Alias Region
MMTAppReg10.MEMORYMAP.ReservedRegion=true
MMTAppReg10.MEMORYMAP.Size=523264
MMTAppReg10.MEMORYMAP.StartAddress=0x34100400
MMTAppReg2.MEMORYMAP.AppRegionName=FLASH
MMTAppReg2.MEMORYMAP.ContextName=FSBL
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg2.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg2.MEMORYMAP.DefaultDataRegion=false
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,Security,ContextName,Name,DefaultCodeRegion,ISRRegion,RootBootRegion
MMTAppReg2.MEMORYMAP.ISRRegion=true
MMTAppReg2.MEMORYMAP.Name=FLASH
MMTAppReg2.MEMORYMAP.RootBootRegion=true
MMTAppReg2.MEMORYMAP.Security=S
MMTAppReg2.MEMORYMAP.Size=261120
MMTAppReg2.MEMORYMAP.StartAddress=0x34180400
MMTAppReg3.MEMORYMAP.AppRegionName=RAM
MMTAppReg3.MEMORYMAP.ContextName=AppliSecure
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg3.MEMORYMAP.DefaultDataRegion=true
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,Security,ContextName,Name
MMTAppReg3.MEMORYMAP.Name=RAM
MMTAppReg3.MEMORYMAP.Security=S
MMTAppReg3.MEMORYMAP.Size=638976
MMTAppReg3.MEMORYMAP.StartAddress=0x34064000
MMTAppReg4.MEMORYMAP.AppRegionName=RAM (S) Reserved Alias Region
MMTAppReg4.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg4.MEMORYMAP.DefaultDataRegion=false
MMTAppReg4.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg4.MEMORYMAP.Name=RAM (S) Reserved Alias Region
MMTAppReg4.MEMORYMAP.ReservedRegion=true
MMTAppReg4.MEMORYMAP.Size=638976
MMTAppReg4.MEMORYMAP.StartAddress=0x24064000
MMTAppReg5.MEMORYMAP.AppRegionName=FLASH
MMTAppReg5.MEMORYMAP.ContextName=AppliSecure
MMTAppReg5.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg5.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg5.MEMORYMAP.DefaultDataRegion=false
MMTAppReg5.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,Security,ContextName,Name,DefaultCodeRegion,ISRRegion,RootBootRegion
MMTAppReg5.MEMORYMAP.ISRRegion=true
MMTAppReg5.MEMORYMAP.Name=FLASH
MMTAppReg5.MEMORYMAP.RootBootRegion=true
MMTAppReg5.MEMORYMAP.Security=S
MMTAppReg5.MEMORYMAP.Size=408576
MMTAppReg5.MEMORYMAP.StartAddress=0x34000400
MMTAppReg6.MEMORYMAP.AppRegionName=FLASH (S) Reserved Alias Region
MMTAppReg6.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg6.MEMORYMAP.DefaultDataRegion=false
MMTAppReg6.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg6.MEMORYMAP.Name=FLASH (S) Reserved Alias Region
MMTAppReg6.MEMORYMAP.ReservedRegion=true
MMTAppReg6.MEMORYMAP.Size=408576
MMTAppReg6.MEMORYMAP.StartAddress=0x24000400
MMTAppReg7.MEMORYMAP.AppRegionName=RAM
MMTAppReg7.MEMORYMAP.ContextName=AppliNonSecure
MMTAppReg7.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg7.MEMORYMAP.DefaultDataRegion=true
MMTAppReg7.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg7.MEMORYMAP.Name=RAM
MMTAppReg7.MEMORYMAP.Size=524288
MMTAppReg7.MEMORYMAP.StartAddress=0x24180000
MMTAppReg8.MEMORYMAP.AppRegionName=RAM (NS) Reserved Alias Region
MMTAppReg8.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg8.MEMORYMAP.DefaultDataRegion=false
MMTAppReg8.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg8.MEMORYMAP.Name=RAM (NS) Reserved Alias Region
MMTAppReg8.MEMORYMAP.ReservedRegion=true
MMTAppReg8.MEMORYMAP.Size=524288
MMTAppReg8.MEMORYMAP.StartAddress=0x34180000
MMTAppReg9.MEMORYMAP.AppRegionName=FLASH
MMTAppReg9.MEMORYMAP.ContextName=AppliNonSecure
MMTAppReg9.MEMORYMAP.CoreName=ARM Cortex-M55
MMTAppReg9.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg9.MEMORYMAP.DefaultDataRegion=false
MMTAppReg9.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,DefaultCodeRegion,ISRRegion,RootBootRegion
MMTAppReg9.MEMORYMAP.ISRRegion=true
MMTAppReg9.MEMORYMAP.Name=FLASH
MMTAppReg9.MEMORYMAP.RootBootRegion=true
MMTAppReg9.MEMORYMAP.Size=523264
MMTAppReg9.MEMORYMAP.StartAddress=0x24100400
MMTAppRegionsCount=10
MMTConfigApplied=false
MMTSectionSuffix=
Mcu.CPN=STM32N647I0H3Q
Mcu.Context0=FSBL
Mcu.Context1=AppliSecure
Mcu.Context2=AppliNonSecure
Mcu.Context3=ExtMemLoader
Mcu.ContextNb=4
Mcu.ContextProject=SecureNSecure
Mcu.Family=STM32N6
Mcu.IP0=ADC1
Mcu.IP1=CORTEX_M55_FSBL
Mcu.IP10=NVIC1
Mcu.IP11=NVIC2
Mcu.IP12=NVIC
Mcu.IP13=RCC
Mcu.IP14=RIF
Mcu.IP15=SPI1
Mcu.IP16=SPI5
Mcu.IP17=SYS
Mcu.IP18=TIM1
Mcu.IP19=TIM2
Mcu.IP2=CORTEX_M55_NS
Mcu.IP20=TIM3
Mcu.IP21=TIM4
Mcu.IP22=TIM5
Mcu.IP23=TIM6
Mcu.IP24=TIM9
Mcu.IP25=XSPI2
Mcu.IP26=XSPIM
Mcu.IP3=CORTEX_M55_S
Mcu.IP4=DEBUG
Mcu.IP5=FDCAN1
Mcu.IP6=FDCAN2
Mcu.IP7=FDCAN3
Mcu.IP8=GPDMA1
Mcu.IP9=MEMORYMAP
Mcu.IPNb=27
Mcu.Name=STM32N647I0HxQ
Mcu.Package=VFBGA178
Mcu.Pin0=PH1-OSC_OUT(PH1)
Mcu.Pin1=PD0
Mcu.Pin10=PF6
Mcu.Pin11=PN4
Mcu.Pin12=PN8
Mcu.Pin13=PF2
Mcu.Pin14=PF14
Mcu.Pin15=PF15
Mcu.Pin16=PF7
Mcu.Pin17=PN6
Mcu.Pin18=PN5
Mcu.Pin19=PF8
Mcu.Pin2=PD3
Mcu.Pin20=PF12
Mcu.Pin21=PB4(NJTRST)
Mcu.Pin22=PN2
Mcu.Pin23=PN9
Mcu.Pin24=PB12
Mcu.Pin25=PB5(JTDO/TRACESWO)
Mcu.Pin26=PN0
Mcu.Pin27=PN10
Mcu.Pin28=PG10
Mcu.Pin29=PN3
Mcu.Pin3=PC14-OSC32_IN(OSC32_IN)
Mcu.Pin30=PN11
Mcu.Pin31=PA14(JTCK/SWCLK)
Mcu.Pin32=PA13(JTMS/SWDIO)
Mcu.Pin33=PA0
Mcu.Pin34=PN1
Mcu.Pin35=VP_GPDMA1_VS_GPDMACH0
Mcu.Pin36=VP_GPDMA1_VS_GPDMACH1
Mcu.Pin37=VP_GPDMA1_VS_GPDMACH2
Mcu.Pin38=VP_GPDMA1_VS_GPDMACH3
Mcu.Pin39=VP_RIF_VS_RIF1
Mcu.Pin4=PH0-OSC_IN(PH0)
Mcu.Pin40=VP_SYS_VS_Systick
Mcu.Pin41=VP_TIM1_VS_ClockSourceINT
Mcu.Pin42=VP_TIM2_VS_ClockSourceINT
Mcu.Pin43=VP_TIM3_VS_ClockSourceINT
Mcu.Pin44=VP_TIM4_VS_ClockSourceINT
Mcu.Pin45=VP_TIM5_VS_ClockSourceINT
Mcu.Pin46=VP_TIM6_VS_ClockSourceINT
Mcu.Pin47=VP_TIM9_VS_ClockSourceINT
Mcu.Pin48=VP_XSPI2_VS_octo
Mcu.Pin49=VP_XSPIM_VS_IO
Mcu.Pin5=PE11
Mcu.Pin50=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin51=VP_STMicroelectronics.X-CUBE-ALGOBUILD_AppNS_VS_DSPOoLibraryJjLibrary_1.4.0_1.4.0
Mcu.Pin6=PD1
Mcu.Pin7=PE9
Mcu.Pin8=PE12
Mcu.Pin9=PF4
Mcu.PinsNb=52
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-ALGOBUILD.1.4.0
Mcu.ThirdParty0_ContextShortName=AppNS
Mcu.ThirdParty0_Instance=STMicroelectronics.X-CUBE-ALGOBUILD.1.4.0_AppNS
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32N647I0HxQ
MxCube.Version=6.16.1
MxDb.Version=DB.6.0.161
NVIC.BFHFNMINS=0
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.FDCAN1_IT0_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.FDCAN2_IT0_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.FDCAN3_IT0_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.ForceEnableDMAVector=true
NVIC.GPDMA1_Channel0_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.GPDMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.GPDMA1_Channel2_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.GPDMA1_Channel3_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PRIS=0
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SPI1_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.SPI5_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.TIM3_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.BFHFNMINS=0
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.ForceEnableDMAVector=true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PRIS=0
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.BFHFNMINS=0
NVIC2.ForceEnableDMAVector=true
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PRIS=0
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Mode=IN0-Single-Ended
PA0.PinAttribute=FSBL
PA0.Signal=ADC1_INP0
PA13(JTMS/SWDIO).GPIOParameters=PinAttribute
PA13(JTMS/SWDIO).Mode=Serial_Wire
PA13(JTMS/SWDIO).PinAttribute=FSBL
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).GPIOParameters=PinAttribute
PA14(JTCK/SWCLK).Mode=Serial_Wire
PA14(JTCK/SWCLK).PinAttribute=FSBL
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PB12.GPIOParameters=PinAttribute
PB12.Mode=FDCAN_Activate
PB12.PinAttribute=FSBL
PB12.Signal=FDCAN2_RX
PB4(NJTRST).GPIOParameters=PinAttribute
PB4(NJTRST).Locked=true
PB4(NJTRST).Mode=Full_Duplex_Slave
PB4(NJTRST).PinAttribute=FSBL
PB4(NJTRST).Signal=SPI1_MISO
PB5(JTDO/TRACESWO).GPIOParameters=PinAttribute
PB5(JTDO/TRACESWO).Mode=Full_Duplex_Slave
PB5(JTDO/TRACESWO).PinAttribute=FSBL
PB5(JTDO/TRACESWO).Signal=SPI1_MOSI
PC14-OSC32_IN(OSC32_IN).ContextOwner=FSBL
PC14-OSC32_IN(OSC32_IN).GPIOParameters=PinState,PinAttribute
PC14-OSC32_IN(OSC32_IN).Locked=true
PC14-OSC32_IN(OSC32_IN).PinAttribute=FSBL
PC14-OSC32_IN(OSC32_IN).PinState=GPIO_PIN_SET
PC14-OSC32_IN(OSC32_IN).Signal=GPIO_Output
PCC.Checker=false
PCC.Line=STM32N6x7
PCC.MCU=STM32N647I0HxQ
PCC.PartNumber=STM32N647I0HxQ
PCC.Series=STM32N6
PCC.Temperature=25
PCC.Vdd=1.8
PD0.GPIOParameters=PinAttribute
PD0.Mode=FDCAN_Activate
PD0.PinAttribute=FSBL
PD0.Signal=FDCAN1_RX
PD1.GPIOParameters=PinAttribute
PD1.Locked=true
PD1.Mode=FDCAN_Activate
PD1.PinAttribute=FSBL
PD1.Signal=FDCAN1_TX
PD3.ContextOwner=FSBL
PD3.GPIOParameters=PinAttribute
PD3.Locked=true
PD3.PinAttribute=FSBL
PD3.Signal=GPIO_Output
PE11.GPIOParameters=PinAttribute
PE11.Mode=FDCAN_Activate
PE11.PinAttribute=FSBL
PE11.Signal=FDCAN3_TX
PE12.GPIOParameters=PinAttribute
PE12.Mode=FDCAN_Activate
PE12.PinAttribute=FSBL
PE12.Signal=FDCAN3_RX
PE9.ContextOwner=FSBL
PE9.GPIOParameters=PinAttribute
PE9.Locked=true
PE9.PinAttribute=FSBL
PE9.Signal=GPIO_Output
PF12.GPIOParameters=PinAttribute
PF12.Locked=true
PF12.Mode=Full_Duplex_Master
PF12.PinAttribute=FSBL
PF12.Signal=SPI5_MISO
PF14.GPIOParameters=GPIO_PuPd,PinAttribute
PF14.GPIO_PuPd=GPIO_PULLUP
PF14.Mode=Full_Duplex_Master
PF14.PinAttribute=FSBL
PF14.Signal=SPI5_MOSI
PF15.GPIOParameters=GPIO_PuPd,PinAttribute
PF15.GPIO_PuPd=GPIO_PULLUP
PF15.Locked=true
PF15.Mode=Full_Duplex_Master
PF15.PinAttribute=FSBL
PF15.Signal=SPI5_SCK
PF2.ContextOwner=FSBL
PF2.GPIOParameters=PinState,PinAttribute
PF2.Locked=true
PF2.PinAttribute=FSBL
PF2.PinState=GPIO_PIN_SET
PF2.Signal=GPIO_Output
PF4.GPIOParameters=PinAttribute
PF4.Mode=NSS_Signal_Hard_Input
PF4.PinAttribute=FSBL
PF4.Signal=SPI1_NSS
PF6.ContextOwner=FSBL
PF6.GPIOParameters=PinAttribute
PF6.Locked=true
PF6.PinAttribute=FSBL
PF6.Signal=GPIO_Output
PF7.GPIOParameters=PinAttribute
PF7.Mode=Full_Duplex_Slave
PF7.PinAttribute=FSBL
PF7.Signal=SPI1_SCK
PF8.ContextOwner=FSBL
PF8.GPIOParameters=PinState,PinAttribute
PF8.Locked=true
PF8.PinAttribute=FSBL
PF8.PinState=GPIO_PIN_SET
PF8.Signal=GPIO_Output
PG10.GPIOParameters=PinAttribute
PG10.Locked=true
PG10.Mode=FDCAN_Activate
PG10.PinAttribute=FSBL
PG10.Signal=FDCAN2_TX
PH0-OSC_IN(PH0).GPIOParameters=PinAttribute
PH0-OSC_IN(PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN(PH0).PinAttribute=Free
PH0-OSC_IN(PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT(PH1).GPIOParameters=PinAttribute
PH1-OSC_OUT(PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT(PH1).PinAttribute=Free
PH1-OSC_OUT(PH1).Signal=RCC_OSC_OUT
PN0.GPIOParameters=PinAttribute
PN0.Mode=XSPI2_Port2Octo
PN0.PinAttribute=FSBL
PN0.Signal=XSPIM_P2_DQS0
PN1.GPIOParameters=PinAttribute
PN1.Mode=XSPI2_NCS1_Port2
PN1.PinAttribute=FSBL
PN1.Signal=XSPIM_P2_NCS1
PN10.GPIOParameters=PinAttribute
PN10.Mode=XSPI2_Port2Octo
PN10.PinAttribute=FSBL
PN10.Signal=XSPIM_P2_IO6
PN11.GPIOParameters=PinAttribute
PN11.Mode=XSPI2_Port2Octo
PN11.PinAttribute=FSBL
PN11.Signal=XSPIM_P2_IO7
PN2.GPIOParameters=PinAttribute
PN2.Mode=XSPI2_Port2Octo
PN2.PinAttribute=FSBL
PN2.Signal=XSPIM_P2_IO0
PN3.GPIOParameters=PinAttribute
PN3.Mode=XSPI2_Port2Octo
PN3.PinAttribute=FSBL
PN3.Signal=XSPIM_P2_IO1
PN4.GPIOParameters=PinAttribute
PN4.Mode=XSPI2_Port2Octo
PN4.PinAttribute=FSBL
PN4.Signal=XSPIM_P2_IO2
